In [10]:
import numpy as np
import pandas as pd

In [11]:
df=pd.read_csv("C:\\Users\\anski\\Desktop\\kartikey_kichara\\vgsales.csv")

In [12]:
df.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [13]:
# df=pd.get_dummies(df,columns=['Name','Platform','Genre','Publisher'],
#                   drop_first=True)

In [14]:
# df.head(4)

In [15]:
# a=df.copy()
# a

In [16]:
# b=a.astype(int)

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
lb=LabelEncoder()

In [19]:
df['Name']=lb.fit_transform(df['Name'])

In [20]:
df.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,11007,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,9327,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,5573,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [21]:
df['Platform']=lb.fit_transform(df['Platform'])
df['Genre']=lb.fit_transform(df['Genre'])
df['Publisher']=lb.fit_transform(df['Publisher'])

In [22]:
df.head(3)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,11007,26,2006.0,10,359,41.49,29.02,3.77,8.46,82.74
1,2,9327,11,1985.0,4,359,29.08,3.58,6.81,0.77,40.24
2,3,5573,26,2008.0,6,359,15.85,12.88,3.79,3.31,35.82

In [24]:
df.isnull().sum()

Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher         0
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64

In [25]:
df=df.dropna()

In [26]:
df

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,11007,26,2006.0,10,359,41.49,29.02,3.77,8.46,82.74
1,2,9327,11,1985.0,4,359,29.08,3.58,6.81,0.77,40.24
2,3,5573,26,2008.0,6,359,15.85,12.88,3.79,3.31,35.82
3,4,11009,26,2009.0,10,359,15.75,11.01,3.28,2.96,33.00
4,5,7346,5,1996.0,7,359,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,11101,6,2002.0,4,269,0.01,0.00,0.00,0.00,0.01
16594,16597,5796,7,2003.0,8,241,0.01,0.00,0.00,0.00,0.01
16595,16598,8144,16,2008.0,6,21,0.00,0.00,0.00,0.00,0.01
16596,16599,5014,4,2010.0,5,8,0.00,0.01,0.00,0.00,0.01
16597,16600,8967,6,2003.0,4,546,0.01,0.00,0.00,0.00,0.01

In [27]:
df.isnull().sum()

Rank            0
Name            0
Platform        0
Year            0
Genre           0
Publisher       0
NA_Sales        0
EU_Sales        0
JP_Sales        0
Other_Sales     0
Global_Sales    0
dtype: int64

In [28]:
df=df.astype(int)

In [29]:
df.head(4)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,11007,26,2006,10,359,41,29,3,8,82
1,2,9327,11,1985,4,359,29,3,6,0,40
2,3,5573,26,2008,6,359,15,12,3,3,35
3,4,11009,26,2009,10,359,15,11,3,2,33

In [30]:
from sklearn.model_selection import train_test_split

In [33]:
x=df.drop(columns=['Global_Sales'])
y=df['Global_Sales']

In [34]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [35]:
from sklearn.preprocessing import StandardScaler

In [36]:
sc=StandardScaler()

In [37]:
x_train_sc=sc.fit_transform(x_train)

In [38]:
x_train_new=pd.DataFrame(x_train_sc,columns=x_train.columns)

In [39]:
np.round(x_train_new.describe(),1)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales
count,13061.0,13061.0,13061.0,13061.0,13061.0,13061.0,13061.0,13061.0,13061.0,13061.0
mean,-0.0,-0.0,0.0,-0.0,-0.0,-0.0,0.0,0.0,-0.0,0.0
std,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
min,-1.7,-1.8,-1.9,-4.5,-1.3,-1.7,-0.2,-0.1,-0.1,-0.1
25%,-0.9,-0.9,-1.0,-0.6,-1.0,-0.9,-0.2,-0.1,-0.1,-0.1
50%,-0.0,0.0,0.0,0.1,0.0,0.2,-0.2,-0.1,-0.1,-0.1
75%,0.9,0.9,0.5,0.6,0.8,0.9,-0.2,-0.1,-0.1,-0.1
max,1.7,1.7,1.7,1.8,1.6,1.6,42.0,32.1,39.1,77.5

In [40]:
from sklearn.preprocessing import MinMaxScaler

In [41]:
mn=MinMaxScaler()

In [42]:
x_train_mn=mn.fit_transform(x_train)

In [43]:
x_train_mn_new=pd.DataFrame(x_train_mn,columns=x_train.columns)

In [44]:
np.round(x_train_mn_new.describe(),2)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales
count,13061.00,13061.00,13061.00,13061.00,13061.00,13061.00,13061.00,13061.00,13061.00,13061.00
mean,0.50,0.51,0.52,0.71,0.45,0.51,0.00,0.00,0.00,0.00
std,0.29,0.29,0.28,0.16,0.34,0.31,0.02,0.03,0.03,0.01
min,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,0.25,0.26,0.23,0.62,0.09,0.24,0.00,0.00,0.00,0.00
50%,0.50,0.51,0.53,0.73,0.45,0.56,0.00,0.00,0.00,0.00
75%,0.75,0.76,0.67,0.81,0.73,0.79,0.00,0.00,0.00,0.00
max,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00

In [45]:
x.shape

(16327, 10)

In [46]:
y.shape

(16327,)

In [47]:
x_train.shape

(13061, 10)

In [48]:
y_train.shape

(13061,)

In [49]:
x_test.shape

(3266, 10)

In [50]:
y_test.shape

(3266,)

In [51]:
df.shape

(16327, 11)

In [82]:
a=pd.read_csv("C:\\Users\\anski\\Desktop\\kartikey_kichara\\vgsales.csv")
a.head()
a['Publisher'].value_counts()
# a['Name'].value_counts(

Publisher
Electronic Arts                 1351
Activision                       975
Namco Bandai Games               932
Ubisoft                          921
Konami Digital Entertainment     832
                                ...
Warp                               1
New                                1
Elite                              1
Evolution Games                    1
UIG Entertainment                  1
Name: count, Length: 578, dtype: int64

In [74]:
a.head(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [70]:
from sklearn.compose import ColumnTransformer

In [83]:
from sklearn.impute import SimpleImputer
# from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import OneHotEncoder

In [88]:
transform=ColumnTransformer(transformers=[('tnf1',SimpleImputer(),['Name']),
                                         ('tnf2',OneHotEncoder(sparse_output=False,drop='first'),['Platform','Genre','Publisher'])],remainder='passthrough')

In [91]:
transform.fit_transform(x_train).shape

(13061, 578)